# Задание №1

vid = input('Введите вид вашего питомца: ')
age = input('Введите возраст вашего питомца: ')
name = input('Введите кличку вашего питомца: ')

print(f'Это {vid} по кличке "{name}". Возраст: {age}.')


# Задание №2

austral = input('Введите первый этап эволюции человека: ')
homo_habilis = input('Введите второй этап эволюции человека: ')
homo_erectus = input('Введите третий этап эволюции человеа:')
homo_heidel= input('Введите четвертый этап эволюции человека:')
neander = input('Введите пятый этап эволюции человека:')
denisova = input('Введите шестой этап эволюции человека: ')
sapiens = input('Введите седьмой этап эволюции человека: ')

print(austral, homo_habilis, homo_erectus, homo_heidel, neander, denisova, sapiens, sep =" => ")